using NUnit.Framework;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace NUnitTestProj
{
    class NumberToWordTest
    {
        [Test]
        public void number_words5Rupee()
        {
            double[] inp = { 5, 50, 55, 500, 550, 555, 5000, 5500, 5550, 5555, 50000, 55000, 55500, 55550, 55555, 500000, 550000, 555000, 555500, 555550, 555555, 5000000, 5500000, 5550000, 5555000, 5555500, 5555550, 5555555 };
            IList<double> c1 = inp.OfType<double>().ToList();
            string[] res = c1.Select(x => NepaliCalendar.Number2Words.ConvertAmountUniCode(x)).ToArray();
            string[] exp = { "पाँच रुपैंया मात्र", "पचास रुपैंया मात्र", "पच्पन्न रुपैंया मात्र",
                "पाँच सय रुपैंया मात्र", "पाँच सय पचास रुपैंया मात्र", "पाँच सय पच्पन्न रुपैंया मात्र",
                "पाँच हजार रुपैंया मात्र", "पाँच हजार पाँच सय रुपैंया मात्र", "पाँच हजार पाँच सय पचास रुपैंया मात्र", "पाँच हजार पाँच सय पच्पन्न रुपैंया मात्र",
                "पचास हजार रुपैंया मात्र", "पच्पन्न हजार रुपैंया मात्र", "पच्पन्न हजार पाँच सय रुपैंया मात्र", "पच्पन्न हजार पाँच सय पचास रुपैंया मात्र", "पच्पन्न हजार पाँच सय पच्पन्न रुपैंया मात्र",
                "पाँच लाख रुपैंया मात्र", "पाँच लाख पचास हजार रुपैंया मात्र", "पाँच लाख पच्पन्न हजार रुपैंया मात्र", "पाँच लाख पच्पन्न हजार पाँच सय रुपैंया मात्र", "पाँच लाख पच्पन्न हजार पाँच सय पचास रुपैंया मात्र", "पाँच लाख पच्पन्न हजार पाँच सय पच्पन्न रुपैंया मात्र",
                "पचास लाख रुपैंया मात्र", "पच्पन्न लाख रुपैंया मात्र", "पच्पन्न लाख पचास हजार रुपैंया मात्र", "पच्पन्न लाख पच्पन्न हजार रुपैंया मात्र", "पच्पन्न लाख पच्पन्न हजार पाँच सय रुपैंया मात्र", "पच्पन्न लाख पच्पन्न हजार पाँच सय पचास रुपैंया मात्र", "पच्पन्न लाख पच्पन्न हजार पाँच सय पच्पन्न रुपैंया मात्र"
                };

            CollectionAssert.AreEqual(res, exp);
        }

        [Test]
        public void number_words05Rupee()
        {
            double[] inp = { 505, 5005, 50005, 500005, 50050, 50500 };
            IList<double> c1 = inp.OfType<double>().ToList();
            string[] res = c1.Select(x => NepaliCalendar.Number2Words.ConvertAmountUniCode(x)).ToArray();
            string[] exp = {
                "पाँच सय पाँच रुपैंया मात्र",
                "पाँच हजार पाँच रुपैंया मात्र",
                "पचास हजार पाँच रुपैंया मात्र",
                "पाँच लाख पाँच रुपैंया मात्र", 
                //"पचास लाख पाँच रुपैंया मात्र",
                "पचास हजार पचास रुपैंया मात्र", "पचास हजार पाँच सय रुपैंया मात्र"
                };
            CollectionAssert.AreEqual(res, exp);
        }
        [Test]
        public void number_words05dotRupee()
        {
            double[] inp = { 505.05, 5005.5, 50005.55, 500005.05, 50050.5, 50500.55 };
            IList<double> c1 = inp.OfType<double>().ToList();
            string[] res = c1.Select(x => NepaliCalendar.Number2Words.ConvertAmountUniCode(x)).ToArray();
            string[] exp = {
                "पाँच सय पाँच रुपैंया पाँच पैसा मात्र",
                "पाँच हजार पाँच रुपैंया पचास पैसा मात्र",
                "पचास हजार पाँच रुपैंया पच्पन्न पैसा मात्र",
                "पाँच लाख पाँच रुपैंया पाँच पैसा मात्र", 
                //"पचास लाख पाँच रुपैंया मात्र",
                "पचास हजार पचास रुपैंया पचास पैसा मात्र", "पचास हजार पाँच सय रुपैंया पच्पन्न पैसा मात्र"
                };
            for (var i = 0; i < inp.Length; i++)
            {
                Assert.AreEqual(res[i], exp[i]);
            }
            CollectionAssert.AreEqual(res, exp);
        }
    }
}
